puts "----------------------------------------task 1---------------------------------------"
s='Кукушка кукушонку купила капюшон'
s.gsub!("купила","подарила")
puts s
puts "-----------------------------------------------------------------------------"
days_of_week = ['понедельник', 'вторник', 'среда', 'четверг', 'пятница', 'суббота', 'воскреснье']
puts days_of_week.first
puts days_of_week.last
puts days_of_week.reverse

person={'Фамилия':"Иванов", 'Имя':"Иван", 'Отчество':"Иванович" }
person.each { |k, v| puts k }
person.each { |k, v| puts v }